<?php

use yii\db\Migration;
use yii\db\Schema;

class m160912_062521_film extends Migration
{
    public function safeUp()
    {
        $tableOptions = null;
        if ($this->db->driverName === 'mysql') {
            $tableOptions = 'CHARACTER SET utf8 COLLATE utf8_general_ci ENGINE=InnoDB';
        }

        $this->createTable('{{%film}}', [
            'id' => Schema::TYPE_PK,
            'title' => Schema::TYPE_STRING . ' NOT NULL',
            'description' => Schema::TYPE_TEXT . ' NOT NULL',
            'isliked' => Schema::TYPE_BOOLEAN . ' DEFAULT 0',
        ], $tableOptions);

        $this->insert('film', [
            'title'=>'Прибытие',
            'description' =>'
                По всему миру приземляются инопланетные корабли. Армейские чины находят лингвистку, которая должна понять, 
                что несет за собой визит пришельцев — мир или войну. Главная героиня постепенно учится общаться с инопланетянами
                 и вместе с этим испытывает серию флешбэков, благодаря чему узнает тайну, с которой 
            ',
        ]);
        $this->insert('film', [
            'title'=>'Сплит',
            'description' =>'
                Кевин, человек, в котором живет не менее двадцати трех личностей, вынужден похитить трех девочек подросткового возраста.
                 Тем временем, пока они находятся в заточении, самая главная личность Кевина — Чудовище — материализуется.
            ',
        ]);
        $this->insert('film', [
            'title'=>'Союзники',
            'description' =>'
                1942 год. После страстного романа с француженкой во время опасной миссии в Северной Африке, американскому агенту контрразведки сообщают, 
                что женщина, на которой он женат и с которой у него есть ребенок, скорее всего, нацистский шпион.
            ',
        ]);
        $this->insert('film', [
            'title'=>'Ла-Ла Ленд',
            'description' =>'
                Это история любви старлетки, которая между прослушиваниями подает кофе состоявшимся кинозвездам, и фанатичного джазового музыканта, 
                вынужденного подрабатывать в заштатных барах. Но пришедший к влюбленным успех начинает подтачивать их отношения…
            ',
        ]);
        $this->insert('film', [
            'title'=>'Под покровом ночи',
            'description' =>'
                У Сьюзен роскошная жизнь в Лос-Анджелесе, прекрасный муж и собственная галерея. Но однажды она получает неожиданную посылку от бывшего супруга — он хотел бы встретиться,
                 но сначала просит прочитать его новый роман. Сьюзен не подозревает, что как только она откроет рукопись, она вернется в прошлое, которое считала надежно 
            ',
        ]);
        $this->insert('film', [
            'title'=>'Дюнкерк',
            'description' =>'
                Фильм расскажет историю чудесного спасения более трехсот тысяч солдат в ходе Дюнкеркской операции, имевшей место в начале Второй мировой войны. 
                События начинаются со сцен окружения сотен тысяч британских и союзных войск силами противника. Пойманные в ловушку на пляже и находясь спиной к морю, они 
            ',
        ]);
        $this->insert('film', [
            'title'=>'Пассажиры',
            'description' =>'
                Космический корабль с 5,000 пассажиров на борту, погруженных на время полета в искусственный сон, держит курс на планету, которая станет для них новым домом.
                 Всё идет по плану, но из-за сбоя системы двое пассажиров неожиданно просыпаются и понимают, что до конечного пункта путешествия — 90 лет пути, и им 
            ',
        ]);
        $this->insert('film', [
            'title'=>'Темная башня',
            'description' =>'
                Главный герой — стрелок Роланд Дискейн, отправившийся на поиски Темной Башни — оплота Вселенной — удерживающей все миры от хаоса и разрушения.
            ',
        ]);
        $this->insert('film', [
            'title'=>'Доктор Стрэндж',
            'description' =>'
                Стефан Стрейндж был искусным хирургом, слишком влюбленным в свою работу и бесконечно уверенным в себе. Страшная автокатастрофа лишила руки доктора былой чувствительности. 
                Потеряв смысл жизни, герой отправился на поиски средства исцеления тела и души и, спустя многие годы, стал одним из могущественных магов Земли.
            ',
        ]);
        $this->insert('film', [
            'title'=>'Расплата',
            'description' =>'
                Лента расскажет историю математического гения Кристиана Вульфа, который подрабатывает аудитором для самых опасных преступных организаций. 
                Когда ему «на хвост» садится отдел по борьбе с преступностью Министерства финансов во главе с Рэем Кингом Кристиан решает найти себе 
            ',
        ]);
        $this->insert('film', [
            'title'=>'Ученик',
            'description' =>'
                Мир устроен неправильно. Мир погряз во зле. Много лжи, вранья, лицемерия. Добродетель поругана. Вера утрачена. Главный герой, мальчик Вениамин, считает, что знает все о моральных нормах.
                 Как их надо соблюдать, от кого их надо защищать, что такое хорошо и что такое плохо. Его поведение для окружающих становится серьезным испытанием. Где граница между 
            ',
        ]);
    }

    public function safeDown()
    {
    }
}
